#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.aws_ami.ubuntu: Reading...
data.aws_availability_zones.available: Reading...
aws_vpc.rdx_vpc: Refreshing state... [id=vpc-0430a48299f68dc3c]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0778521d914d23bc1]
aws_route_table.rdx_private_route_table: Refreshing state... [id=rtb-0b14612f156e24d70]
aws_subnet.rdx_public_subnet[0]: Refreshing state... [id=subnet-060d2beab24ecd3c5]
aws_subnet.rdx_private_subnet[1]: Refreshing state... [id=subnet-0fd988ac632e2c9e1]
aws_security_group.rdx_public_security_group: Refreshing state... [id=sg-05275c6c693dd2ac2]
aws_internet_gateway.rdx_internet_gateway: Refreshing state... [id=igw-0b9f77782e09048eb]
aws_subnet.rdx_private_subnet[0]: Refreshing state... [id=subnet-05ff2460501599f94]
aws_security_group.rdx_private_security_group: Refreshing state... [id=sg-03a211740a7b542fd]
aws_security_group_rule.rdx_public_security_group_rules[0]: Refreshing state... [id=sgrule-3399010422]
aws_instance.full_node_ec2[0]: Refreshing state... [id=i-067e8564c0f7d4fb4]
aws_security_group_rule.rdx_public_security_group_rules[1]: Refreshing state... [id=sgrule-3519544619]
aws_security_group_rule.rdx_private_security_group_rules[0]: Refreshing state... [id=sgrule-797323954]
aws_db_subnet_group.rdx_private_subnet_group: Refreshing state... [id=rdx_private_subnet_group]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07182821805cb7d04]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a77362d09a60aada]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.full_node_ec2[0] will be created
  + resource "aws_instance" "full_node_ec2" {
      + ami                                  = "ami-0778521d914d23bc1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-060d2beab24ecd3c5"
      + tags                                 = {
          + "Name" = "RDX Full Node 0"
        }
      + tags_all                             = {
          + "Name" = "RDX Full Node 0"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-05275c6c693dd2ac2",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_route_table.rdx_public_route_table will be created
  + resource "aws_route_table" "rdx_public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0b9f77782e09048eb"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-0430a48299f68dc3c"
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-060d2beab24ecd3c5"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @StatelessOddity, Action: `pull_request`*